keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_regdef.h
/** \\brief  Port Pad Driver Mode 1 Register */
typedef struct _Ifx_P_PDR1_Bits
{
    unsigned int PD8:3;                     /**< \brief [2:0]  (rw) */
    unsigned int PL8:1;                     /**< \brief [3:3]  (rw) */
    unsigned int PD9:3;                     /**< \brief [6:4]  (rw) */
    unsigned int PL9:1;                     /**< \brief [7:7]  (rw) */
    unsigned int PD10:3;                    /**< \brief [10:8]  (rw) */
    unsigned int PL10:1;                    /**< \brief [11:11]  (rw) */
    unsigned int PD11:3;                    /**< \brief [14:12]  (rw) */
    unsigned int PL11:1;                    /**< \brief [15:15]  (rw) */
    unsigned int PD12:3;                    /**< \brief [18:16]  (rw) */
    unsigned int PL12:1;                    /**< \brief [19:19]  (rw) */
    unsigned int PD13:3;                    /**< \brief [22:20]  (rw) */
    unsigned int PL13:1;                    /**< \brief [23:23]  (rw) */
    unsigned int PD14:3;                    /**< \brief [26:24]  (rw) */
    unsigned int PL14:1;                    /**< \brief [27:27]  (rw) */
    unsigned int PD15:3;                    /**< \brief [30:28]  (rw) */
    unsigned int PL15:1;                    /**< \brief [31:31]  (rw) */
} Ifx_P_PDR1_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_union
 * \{  */

/** \\brief  Port Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_ACCEN0_Bits B;
} Ifx_P_ACCEN0;

/** \\brief  Port Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_ACCEN1_Bits B;
} Ifx_P_ACCEN1;

/** \\brief  Port Emergency Stop Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_ESR_Bits B;
} Ifx_P_ESR;

/** \\brief  Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_ID_Bits B;
} Ifx_P_ID;

/** \\brief  Port Input Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_IN_Bits B;
} Ifx_P_IN;

/** \\brief  Port Input/Output Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_IOCR0_Bits B;
} Ifx_P_IOCR0;

/** \\brief  Port Input/Output Control Register 12 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_IOCR12_Bits B;
} Ifx_P_IOCR12;

/** \\brief  Port Input/Output Control Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_IOCR4_Bits B;
} Ifx_P_IOCR4;

/** \\brief  Port Input/Output Control Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_IOCR8_Bits B;
} Ifx_P_IOCR8;

/** \\brief  Port LVDS Pad Control Register 0
 * Port LVDS Pad Control Register 0
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Port LVDS Pad Control Register 0 */
    Ifx_P_LPCR0_P21_Bits B_P21;
    /** \brief Bitfield access: Port LVDS Pad Control Register 0 */
    Ifx_P_LPCR0_Bits B;
} Ifx_P_LPCR0;

/** \\brief  Port LVDS Pad Control Register 1
 * Port LVDS Pad Control Register 1
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Port LVDS Pad Control Register 1 */
    Ifx_P_LPCR1_P21_Bits B_P21;
    /** \brief Bitfield access: Port LVDS Pad Control Register 1 */
    Ifx_P_LPCR1_Bits B;
} Ifx_P_LPCR1;

/** \\brief  Port LVDS Pad Control Register 2
 * Port LVDS Pad Control Register 2
 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access: Port LVDS Pad Control Register 2 */
    Ifx_P_LPCR2_P21_Bits B_P21;
    /** \brief Bitfield access: Port LVDS Pad Control Register 2 */
    Ifx_P_LPCR2_Bits B;
} Ifx_P_LPCR2;

/** \\brief  Port LVDS Pad Control Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_LPCR3_Bits B;
} Ifx_P_LPCR3;

/** \\brief  Port Output Modification Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMCR_Bits B;
} Ifx_P_OMCR;

/** \\brief  Port Output Modification Clear Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMCR0_Bits B;
} Ifx_P_OMCR0;

/** \\brief  Port Output Modification Clear Register 12 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMCR12_Bits B;
} Ifx_P_OMCR12;

/** \\brief  Port Output Modification Clear Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMCR4_Bits B;
} Ifx_P_OMCR4;

/** \\brief  Port Output Modification Clear Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMCR8_Bits B;
} Ifx_P_OMCR8;

/** \\brief  Port Output Modification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_P_OMR_Bits B;
} Ifx_P_OMR;

